In [5]:
import pandas as pd

In [6]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }

In [7]:
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [5]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [6]:
pwd

'c:\\Users\\HP\\AppData\\Local\\Programs\\Microsoft VS Code'

In [8]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [18]:
df1.shape
list1=df1.shape
print("no of rows",list1[0])

no of rows 7

In [8]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

# unique values from gender column

In [19]:
df1.Gender.unique()

array(['Male', 'Female'], dtype=object)

# number of unique values in gender

In [50]:
list1=[df1.Gender.nunique()]
print(list1)

[2]

# count of unique values in gender column

In [52]:
df1.Gender.value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

# nunber of students having marks between 90 to 100 inclusive

In [83]:
list2=df1.Marks
list2
y=0
for i in list2:
    if i>=90 and i<=100:
        y=y+1
        # print(i)
print(y)
#     else:
#         print('no value')

4

In [98]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [101]:
len(df1[df1['Marks'].between(90,100)])

4

# find average marks

In [105]:
df1['Marks'].mean()

92.14285714285714

# apply method

In [124]:
def avr(mark):
    return sum(mark)//len(mark)

list1=df1['Marks'].tolist()
print(avr(list1))

92

# map fundtion

In [126]:
df1['Gender'].map({'Male':1,'Female':0})
df1['Male_female']=df1['Gender'].map({'Male':1,'Female':0})
df1

      Name  Marks  Gender  Half marks  Male_female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

# drop columns

In [136]:
df1.drop(['Half marks'],axis=1,inplace=True)

In [135]:
df1

      Name  Marks  Gender  Half marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

# sort the df as per mark

In [149]:
df1.sort_values(by=['Name','Gender'],ascending=True)

      Name  Marks  Gender
1   Aadhya     89  Female
6  Archana     99  Female
2   Krisha     99  Female
5   Mittal     83  Female
4   Parshv     90    Male
0  Priyang     98    Male
3   Vedant     87    Male

# display name and marks of female students

In [159]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [162]:
df1[['Gender','Marks','Name']]

   Gender  Marks     Name
0    Male     98  Priyang
1  Female     89   Aadhya
2  Female     99   Krisha
3    Male     87   Vedant
4    Male     90   Parshv
5  Female     83   Mittal
6  Female     99  Archana